//******************************************************************************
//
//
//		CPPKad05B「モンスターの収集！」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

#include <iostream>
#include <ctime>
using namespace std;

// クラス定義のヘッダファイル



char *nameData[] = {
	"ウインディ",
	"イシツブテ",
	"イワンコ",
	"オコリザル",

	"カビゴン",
	"ケンタロン",
	"キャタピー",
	"ギャラドス",
	"キングラー",
	"ゴースト",

	"サンド",
	"ジュゴン",
	"スピアー",
	"スリープ",
	"ゼニガメ",

	"ディグダ",
	"ドードー",
	"トランセル",
	"ドククラゲ",

	"ナゾノクサ",
	"ニャビー",
	"ニドラン",

	"バタフリー",
	"ピカチュウ",
	"ピジョン",
	"ヒトカゲ",
	"フシギダネ",
	"ベトベトン",

	"マルマイン",
	"ミニリュウ",
	"ミュウ",
	"ムックル",
	"モクロー",

	"ヤドン",
	"ユンゲラー",

	"ラッタ",
	"ラプラス",
	"リザードン",
	"レアコイル",
};

#define NAME_MAX		(sizeof(nameData) / sizeof(char*))

void getMonster();

//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	srand((unsigned int)time(NULL));

	while (1) {
		// モンスター収集
		getMonster();
		cout << endl;

		// これまでに収集したモンスター数の表示


		cout << "続けますか？（0：続ける、-1：もうあきた）＞";
		int cmd;
		cin >> cmd;
		if (cmd < 0) break;

		cout << endl;
	}

	cout << endl;
	return 0;
}

//******************************************************************************

// モンスター収集
void getMonster()
{
	// 現在のモンスター数の表示


	cout << "モンスターを捕まえますか？（0：うん、-1：逃がす）＞";
	int cmd;
	cin >> cmd;
	if (cmd < 0) return;

	// モンスター配列の宣言




	cout << endl;

	// 再帰呼び出し
	getMonster();
}

//******************************************************************************
