//******************************************************************************
//
//
//		CPPKad08A「石取りゲーム①」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

#include <iostream>
#include <string>
#include <cstdlib>
#include <ctime>
using namespace std;

//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	// 乱数系列の設定
	srand((unsigned int)time(NULL));

	// 説明の表示
	cout << "20個ある石を交互に取っていきます。一度に取れる石の数は1～3個です。" << endl;
	cout << "最後の1つを取った方が負けです。" << endl;
	cout << endl;

	// 初期設定
	int	stone = 20;			// 石の数


	// （以下、作成すること）



	return 0;
}

//******************************************************************************
