//******************************************************************************
//
//
//		CPPKad05A「Cardクラスの生成」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

#include <iostream>
#include <cstdlib>
#include <ctime>
using namespace std;

// クラス定義のヘッダファイル
#include "Card.h"

void drawCard(int n);

//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	srand((unsigned int)time(nullptr));

	while (1) {
		cout << "何枚カードを引きますか？（1～13、-1：やめる）＞";
		int n;
		cin >> n;
		if (n < 0) break;
		cout << endl;

		drawCard(n);
		cout << endl;
	}
	cout << endl;
	return 0;
}

//******************************************************************************

void drawCard(int n)
{
	if (n < 1) {
		cout << endl;
		return;
	}

	Card	card;		// Cardの実体宣言（カードを1枚引く）
	drawCard(n-1);
}

//******************************************************************************
