//******************************************************************************
//
//
//		CPPKad10B「図形を描こう！①」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

#include <iostream>
#include <string>
#include <cstdlib>
#include <ctime>
using namespace std;

// クラス定義のヘッダファイル
#include "Canvas.h"
#include "Shape.h"

//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	Canvas	*c = new Canvas;

	while( 1 ) {
		// 描画する図形の選択
		cout << "何を描画しますか？（0：消去、1：三角形、2：四角形、-1：終了）＞";
		int	n;
		cin >> n;
		if (n < 0) break;	// 終了

		// 選択した図形の描画






		// キャンバスの表示
		c->show();
	}

	delete c;
	return 0;
}

//******************************************************************************
