//******************************************************************************
//
//
//		CPPKad06D「newとdelete①」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

#include <iostream>
#include <cstdlib>
#include <ctime>
using namespace std;

// クラス定義のヘッダファイル
#include "Monster.h"

//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	srand((unsigned int)time(nullptr));

	// Monsterの生成①



	cout << endl;

	// Monsterの生成②



	cout << endl;

	// Monster配列の生成
	while (1) {
		cout << "どうしますか？（0：探す、-1：終了）＞";
		int cmd;
		cin >> cmd;
		if (cmd < 0) break;





		cout << endl;
	}

	return 0;
}

//******************************************************************************
