//******************************************************************************
//
//
//		CPPKad13S「羊をつなげよう！」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

// ヘッダファイルのインクルード
#include <iostream>
#include <string>
#include <cstdlib>
#include <ctime>
using namespace std;

#include "Sheep.h"
#include "List.h"

//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	cout << "ここは世界に羽ばたくECC牧場です！" << endl;
	cout << "次々とやってくる羊たちをつないでください！" << endl;
	cout << "ECC牧場の命運はあなたの腕にかかっています！！" << endl;
	cout << endl;

	srand((unsigned int)time(NULL));

	// 羊リストを宣言



	while( 1 ) {
		// 一覧表示



		cout << endl;

		// 行動選択
		Sheep	sheep;
		cout << "どうしますか？（0：前につなぐ、1：後ろにつなぐ、2:みんな逃がす、3:無視する、-1：終了）＞";
		int	cmd;
		cin >> cmd;
		if (cmd < 0) break;

		// 実行



		cout << endl;
	}

	return 0;
}

//******************************************************************************
