//******************************************************************************
//
//
//		CPPChallenge05「2次元アフィン変換」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

#include <iostream>
using namespace std;

#include "Canvas.h"
#include "Matrix2D.h"
#include "Vector2D.h"

#define PI	3.14159265f

#define CX	15			// 回転の中心
#define CY	10			// 回転の中心

//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	Canvas c;
	Vector2D	v[3] = { Vector2D(15, 5), Vector2D(24, 14), Vector2D(6, 14) };

	while( 1 ) {
		// 描画
		c.clear();
		c.setPoint(CX, CY);			// 回転の中心
		c.drawLine((int)(v[0].x + 0.5f), (int)(v[0].y + 0.5f), (int)(v[1].x + 0.5f), (int)(v[1].y + 0.5f));
		c.drawLine((int)(v[1].x + 0.5f), (int)(v[1].y + 0.5f), (int)(v[2].x + 0.5f), (int)(v[2].y + 0.5f));
		c.drawLine((int)(v[2].x + 0.5f), (int)(v[2].y + 0.5f), (int)(v[0].x + 0.5f), (int)(v[0].y + 0.5f));
		c.show();

		// 座標変換の選択
		cout << "どうしますか？（0：原点へ、1：回転、2：もとの場所へ、3：まとめて、-1：終了）＞";
		int	cmd;
		cin >> cmd;
		if (cmd < 0) break;	// 終了

		// 座標変換行列の作成
		Matrix2D	m;



		// 座標変換



	}
	return 0;
}

//******************************************************************************
