//******************************************************************************
//
//
//		CPPKad09B「基底クラスのポインタ配列」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

#include <iostream>
#include <string>
#include <cstdlib>
#include <ctime>
using namespace std;

// クラス定義のヘッダファイル
#include "Pikmin.h"

//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	srand((unsigned int)time(NULL));

	cout << "あなたは宇宙船のパイロットです。" << endl;
	cout << "ちょっとしたアクシデントでとある惑星に不時着しました！" << endl;
	cout << "ピクミンを探してください！！" << endl;
	cout << endl;







	return 0;
}

//******************************************************************************
