//******************************************************************************
//
//
//		ピクミン
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

#include <iostream>
#include <string>
using namespace std;

#include "Pikmin.h"

//******************************************************************************
//
//		Pikminクラス
//
//******************************************************************************

void Pikmin::intro()
{
	cout << "ぼく普通のピクミン。色がないんだ。" << endl;
}

//******************************************************************************
//
//		RedPikminクラス
//
//******************************************************************************

int RedPikmin::counter = 0;

RedPikmin::RedPikmin() : num(++counter)
{
	cout << "赤ピクミン（No." << num << "）がやってきた！" << endl;
}
RedPikmin::~RedPikmin(){
	cout << "赤ピクミン（No." << num << "）は去っていった・・・" << endl;
}
void RedPikmin::intro()
{
	cout << "ぼく赤ピクミン（No." << num << "）。炎なんかへっちゃらさ！" << endl;
}

//******************************************************************************
//
//		YellowPikminクラス
//
//******************************************************************************

int YellowPikmin::counter = 0;

YellowPikmin::YellowPikmin() : num(++counter)
{
	cout << "黄ピクミン（No." << num << "）がやってきた！" << endl;
}
YellowPikmin::~YellowPikmin(){
	cout << "黄ピクミン（No." << num << "）は去っていった・・・" << endl;
}
void YellowPikmin::intro()
{
	cout << "ぼく黄ピクミン（No." << num << "）。軽いから高いところまで投げられるよ！" << endl;
}

//******************************************************************************
//
//		BluePikminクラス
//
//******************************************************************************

int BluePikmin::counter = 0;

BluePikmin::BluePikmin() : num(++counter)
{
	cout << "青ピクミン（No." << num << "）がやってきた！" << endl;
}
BluePikmin::~BluePikmin(){
	cout << "青ピクミン（No." << num << "）は去っていった・・・" << endl;
}
void BluePikmin::intro()
{
	cout << "ぼく青ピクミン（No." << num << "）。泳ぎが得意なんだ！" << endl;
}

//******************************************************************************
