//******************************************************************************
//
//
//		CPPKad06C「newとdelete②」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

#include <iostream>
#include <cstdlib>
#include <ctime>
using namespace std;

// クラス定義のヘッダファイル
#include "Sheep.h"

void gotoECC();

//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	srand((unsigned int)time(NULL));

	cout << "ここはECC牧場です！羊がいっぱいいます！" << endl;
	cout << "がんばって働いてください！" << endl;
	cout << "すべてはECCのために！!" << endl;
	cout << endl;

	// 働く
	while (1) {
		cout << "どうしますか？（0：ECC牧場へ行く、-1：やだ）＞";
		int cmd;
		cin >> cmd;
		if (cmd < 0) break;

		gotoECC();
		cout << endl;
	}

	// 羊チェック




	return 0;
}

//******************************************************************************

void gotoECC()
{
	Sheep*	p = nullptr;

	while (1) {
		cout << "何をしますか？（0：ベルを鳴らす、1：数える、2：牧羊犬を放す、-1：もうゆるして）＞";
		int cmd;
		cin >> cmd;
		if (cmd < 0) break;
		cout << endl;






		cout << endl;
	}

	// 羊が残っている場合



}

//******************************************************************************
