//******************************************************************************
//
//
//		CPPKad10A「ECCコーヒー」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

#include <iostream>
using namespace std;

#include "HotDrink.h"

//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	cout << "ECCコーヒーへようこそ！" << endl;

	while ( 1 ) {
		cout << "ご注文は？（0：コーヒー、1；紅茶、2：ゆず茶、-1：店を出る）＞";
		int	n;
		cin >> n;
		if ( n < 0 ) break;
		cout << endl;

		switch ( n ) {
		case 0:	// コーヒー
			Coffee* c;
			c = new Coffee;
			c->boilWater();			// お湯を沸かす
			c->dripCoffee();		// コーヒーをドリップする
			c->pourInCup();			// カップに注ぐ
			delete c;
			break;
		case 1:	// 紅茶
			Tea* t;
			t = new Tea;
			t->boilWater();			// お湯を沸かす
			t->steepTeabag();		// ティーバッグを浸す
			t->pourInCup();			// カップに注ぐ
			delete t;
			break;
		case 2:	// ゆず茶
			// （未実装）
			break;
		}

		cout << endl;
		cout << "お待たせしました！ごゆっくりどうぞ！" << endl;
		cout << endl;
	}

	cout << "ありがとうございました！" << endl;

	return 0;
}

//******************************************************************************