//******************************************************************************
//
//
//		CPPKad15B「ECCフーズ（M&A編）①」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

#include <iostream>
#include <list>
using namespace std;

#include "CoffeeShop.h"
#include "DonutShop.h"
#include "Burger.h"

//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	cout << "世界にはばたくECCフーズ！" << endl;
	cout << "ただいまM&Aで拡大中！！" << endl;
	cout << endl;

	CoffeeShop*		pShop = new CoffeeShop;

	while (1) {
		cout << "どの店のメニューを表示しますか？" << endl;
		cout << "（0：ECCコーヒー、1：ECCドーナツ、2：ECCバーガー、-1：終了）";
		int	n;
		cin >> n;
		cout << endl;
		if (n < 0) break;

		// メニューの表示
		pShop->showMenu();
		cout << endl;
	}

	delete pShop;
	return 0;
}

//******************************************************************************
