//******************************************************************************
//
//
//		CPPKad06B「羊飼い、登場！」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

#include <iostream>
#include <cstdlib>
#include <ctime>
using namespace std;

// クラス定義のヘッダファイル
#include "Sheep.h"




void gotoECC();

//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	srand((unsigned int)time(NULL));

	cout << "ここはECC牧場です！羊がいっぱいいます！" << endl;
	cout << "がんばって働いてください！" << endl;
	cout << "すべてはECCのために！!" << endl;
	cout << endl;

	// 働く
	while (1) {
		cout << "どうしますか？（0：ECC牧場へ行く、-1：やだ）＞";
		int cmd;
		cin >> cmd;
		if (cmd < 0) break;

		gotoECC();
		cout << endl;
	}

	// 羊チェック



	return 0;
}

//******************************************************************************

void gotoECC()
{
	// Shepherdクラスの実体を宣言する


	while (1) {
		cout << "どうしますか？（0：ベルを鳴らす、1：数える、2：牧羊犬を放す、-1：終了）＞";
		int cmd;
		cin >> cmd;
		if (cmd < 0) break;
		cout << endl;

		// Shepherdクラスを使って処理する



		cout << endl;
	}
	cout << endl;
}

//******************************************************************************
