//******************************************************************************
//
//
//		CPPChallenge01「マスターマインド」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

#include <iostream>
#include <iomanip>
#include <string>
#include <cstdlib>
#include <ctime>
using namespace std;

// クラス定義のヘッダファイル




//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	// 乱数系列の設定
	srand( (unsigned int)time(NULL) );

	// 桁数の入力






	// すべての桁の値が異なる整数の生成（コンストラクタで生成）






	// メインループ









	// 実体の解放





	return 0;
}

//******************************************************************************
