//******************************************************************************
//
//
//		CPPKad12A「MyStringの並べ替え！」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

// ヘッダファイルのインクルード
#include <iostream>
using namespace std;

#include "MyString.h"

//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	MyString	s[] = {
		"ECC",
		"ABCDE",
		"XYZ",
		"ABC",
		"ECB",
		"ECCC",
	};

	int n = sizeof(s) / sizeof(MyString);

	// 文字列の表示①
	cout << "現在の文字列を表示します！" << endl;
	for (int i = 0; i < n; i++) {
		cout << "s[" << i << "] = \"" << s[i] << "\"" << endl;
	}
	cout << endl;

	// 並べ替え
	cout << "並べ替えます！" << endl;





	cout << endl;

	// 文字列の表示②
	cout << "並べ替え後の文字列です！" << endl;
	for (int i = 0; i < n; i++) {
		cout << "s[" << i << "] = \"" << s[i] << "\"" << endl;
	}
	cout << endl;
	return 0;
}

//******************************************************************************
