//******************************************************************************
//
//
//		CPPKad05D「staticメンバ変数」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

#include <iostream>
using namespace std;

// クラス定義のヘッダファイル
#include "Student.h"

//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	Student		s[4];
	s[0].setData("のび太", 2100000);
	s[1].setData("しずか", 2100100);
	s[2].setData("ジャイアン", 2100999);
	s[3].setData("スネ夫", 2100123);
	cout << endl;

	while (1) {
		cout << "誰を呼び出しますか？" << endl;
		cout << "（0：のび太、1：しずか、2：ジャイアン、3：スネ夫、-1：もういい）＞";
		int n;
		cin >> n;
		if (n < 0) break;

		cout << endl;

		// ジャイアンのときクラス名を「オレ様のクラス」に変更する
        if (n == 2) {
            s[n].setClassName("オレ様のクラス");
        }
		s[n].showData();
		cout << endl;
	}

	cout << endl;

	return 0;
}

//******************************************************************************
