//******************************************************************************
//
//
//		CPPKad16C「ポケットDuck！」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

#include <iostream>
using namespace std;

#include "Duck.h"

//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	cout << "ポケットDuckへようこそ！" << endl;
	cout << "がんばってアヒルをレベルアップさせましょう！" << endl;
	cout << endl;

	Duck*	duck = new Duck;

	while (1) {
		// 行動の選択
		cout << "何をしますか？（0：飛ぶ、1：レベルアップ、-1：終了）";
		int cmd;
		cin >> cmd;
		if (cmd < 0) break;
		// 行動
		switch (cmd) {
		case 0:	duck->fly();		break;		// 飛ぶ
		case 1:	duck->levelUp();	break;		// レベルアップ
		}
		cout << endl;
	}

	delete duck;
	cout << endl;

	return 0;
}

//******************************************************************************
