//******************************************************************************
//
//
//		CPPKad15A「戦え！ピクミン！！」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

#include <iostream>
#include <string>
#include <cstdlib>
#include <ctime>
#include <list>
using namespace std;

// クラス定義のヘッダファイル
#include "Pikmin.h"

//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	srand((unsigned int)time(NULL));

	cout << "あなたは宇宙船のパイロットです。" << endl;
	cout << "ちょっとしたアクシデントでとある惑星に不時着しました！" << endl;
	cout << "ピクミンを探して何かと戦ってください！！" << endl;
	cout << endl;

	// ピクミン管理クラスの実体宣言



	while (1) {
		// ピクミンのデータ表示


		cout << "どうしますか？（0：探す、1：何かと戦う、2：逃がす、-1：あきらめる）";
		int cmd;
		cin >> cmd;
		cout << endl;
		if (cmd < 0) break;

		// コマンドに対応した処理





		cout << endl;
	}

	return 0;
}

//******************************************************************************
