//******************************************************************************
//
//
//		CPPChallenge06「シーンの切り換え」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

#include <iostream>
using namespace std;

#include "SceneTitle.h"
#include "SceneGame.h"

//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	cout << "ゲームプログラムの雛形（ver.2）だよ。" << endl;

	IScene*	pScene = new SceneTitle;
	cout << endl;

	while (1) {
		pScene = pScene->update();
		pScene->draw();
		if (pScene == nullptr) break;
		cout << endl;
	}

	IScene::showCount();
	cout << "無事終了しました！" << endl;
	return 0;
}

//******************************************************************************
