//******************************************************************************
//
//
//		CPPKad04A「月面着陸ゲーム！」
//
//		クラス：
//		氏　名：
//		作成日：
//
//
//******************************************************************************

// ヘッダファイルのインクルード
#include <iostream>
using namespace std;




//******************************************************************************
//
//		main関数
//
//******************************************************************************

int main()
{
	cout << "月面着陸ゲーム！！" << endl;
	cout << "ロケットを操って無事着陸してください。" << endl;
	cout << "高度が0以下になったら着陸です。" << endl;
	cout << "ただし、落下速度が10を越えているとロケットは粉々になります。" << endl;
	cout << "うまく逆噴射して、着陸してください。" << endl;
	cout << endl;
	cout << "幸運を祈る！！" << endl;
	cout << endl;






	return 0;
}

//******************************************************************************
